#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Fri Mar 29 16:05:56 2024

add_design "C:/Users/86151/Desktop/auido_fft_fir/fft_top/src/fft_ctrl.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/fft_top/src/fft_test.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/fft_top/FPGA_Asynchronous_FIFO-main/src/asyn_fifo.v"
add_simulation "C:/Users/86151/Desktop/auido_fft_fir/fft_top/sim/tb_fft_test.v"
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL12G -speedgrade -5 -package FBG256
compile -top_module fft_test
synthesize -ads -selected_syn_tool_opt 2 
