#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Mon Apr  1 10:14:13 2024

add_design "C:/Users/86151/Desktop/auido_fft_fir/fft_top/src/cordic_newton.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/fft_top/src/data_module_fft.v"
add_simulation "C:/Users/86151/Desktop/auido_fft_fir/fft_top/sim/tb_data_module_fft.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module data_module_fft
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module data_module_fft
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module data_module_fft
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module data_module_fft
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module data_module_fft
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module data_module_fft
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module data_module_fft
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
