#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Sun May 26 12:00:08 2024

add_design "C:/Users/86151/Desktop/auido_fft_fir/ziguangTongchuang_Competition_Documents/src/udp_top/gmii_to_rgmii.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/ziguangTongchuang_Competition_Documents/src/udp_top/udp_loop_noarp.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/ziguangTongchuang_Competition_Documents/src/udp_top/udp_rx.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/ziguangTongchuang_Competition_Documents/src/udp_top/udp_top.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/ziguangTongchuang_Competition_Documents/src/udp_top/udp_tx.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/ziguangTongchuang_Competition_Documents/src/udp_top/crc32_d8.v"
add_design C:/Users/86151/Desktop/auido_fft_fir/ziguangTongchuang_Competition_Documents/prj/prj_udp_loop_noarp/ipcore/fifo_udp_loop/fifo_udp_loop.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_loop_noarp
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
add_constraint "C:/Users/86151/Desktop/auido_fft_fir/ziguangTongchuang_Competition_Documents/prj/prj_udp_loop_noarp/source/udp_top/udp_loop.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_loop_noarp
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_loop_noarp
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_loop_noarp
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_loop_noarp
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
