#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Wed May  8 09:51:46 2024

add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_top/src/audio/ES7243E_reg_config.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_top/src/audio/ES8156_reg_config.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_top/src/audio/i2c_com.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_top/src/audio/i2s_loop.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_top/src/audio/pgr_i2s_rx.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_top/src/audio/pgr_i2s_tx.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_top/src/audio/voice_loop.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_top/src/fir_paral/fir_guide.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_top/src/fir_paral/mult_cell.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_top/src/fir_paral/mult_man.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_top/src/audio_fir.v"
add_design C:/Users/86151/Desktop/auido_fft_fir/audio_top/prj_file_test/prj_audio_fir/ipcore/PLL/PLL.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module audio_fir
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "C:/Users/86151/Desktop/auido_fft_fir/audio_top/prj_file_test/prj_audio_fir/source/audio/voice.fdc"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module audio_fir
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module audio_fir
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module audio_fir
