#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Fri Apr 19 21:05:55 2024

add_design C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/prj_pango/ipcore/PLL/PLL.idf
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/arp/arp.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/arp/arp_rx.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/arp/arp_tx.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/arp/crc32_d8.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/audio_revised/audio_data_pkt.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/audio_revised/audio_udp_top.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/gmii_to_rgmii/gmii_to_rgmii.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/gmii_to_rgmii/rgmii_rx.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/gmii_to_rgmii/rgmii_tx.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/udp/udp.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/udp/udp_rx.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/udp/udp_tx.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/eth_ctrl.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/eth_top.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/start_transfer_ctrl.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/udp_audio_test.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/audio/ES7243E_reg_config.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/audio/ES8156_reg_config.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/audio/i2c_com.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/audio/i2s_loop.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/audio/pgr_i2s_rx.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/audio/pgr_i2s_tx.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/audio/voice_loop.v"
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/fft_top/asyn_fifo.v"
add_design C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/prj_pango/ipcore/idp/idp/udp_pll.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
add_design C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/prj_pango/ipcore/fifo/fifo.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
remove_design -verilog "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/gmii_to_rgmii/rgmii_rx.v"
remove_design -verilog "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/gmii_to_rgmii/rgmii_tx.v"
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/prj_pango/ipcore/fifo/fifo.idf
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_constraint "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/udp_aduio_test.fdc"
set_arch -family Logos -device PGL25G -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50G -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/audio_revised/audio_udp_top_revised.v"
remove_design -force -verilog "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/audio_revised/audio_udp_top.v"
remove_design -verilog "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/start_transfer_ctrl.v"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module udp_audio_test
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force -verilog "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/eth_top.v"
remove_design -verilog "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/arp/arp.v"
remove_design -verilog "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/eth_ctrl.v"
remove_design -verilog "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/arp/arp_rx.v"
remove_design -verilog "C:/Users/86151/Desktop/auido_fft_fir/audio_fft_fir_hdmi/src/UDP/arp/arp_tx.v"
