#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Wed Jun 12 10:41:04 2024

add_design "C:/Users/86151/Desktop/fifo_ambition/src/fifo_ambition.v"
add_design C:/Users/86151/Desktop/fifo_ambition/prj/ipcore/fifo_ambition/fifo_ambition.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
add_simulation "C:/Users/86151/Desktop/fifo_ambition/src/tb_fifo_ambition.v"
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
add_design C:/Users/86151/Desktop/fifo_ambition/prj/ipcore/fifo_ambition_re/fifo_ambition_re.idf
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module fifo_ambition_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
