#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Mon Jul 22 15:36:37 2024

set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
add_fic "C:/Users/86151/Desktop/auido_fft_fir/ziguangTongchuang_Competition_Documents/prj/prj_hsst/ipcore/hsst_test/pnr/example_design/synthesize/hsst_test_dut_top_syn.fic"
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module hsst_test_dut_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
